app/controllers/posts_controller.rb

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "published", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "abc"], ["created_at", Sun, 02 Feb 2014 00:20:44 UTC +00:00], ["published", "1"], ["title", "abc"], ["updated_at", Sun, 02 Feb 2014 00:20:44 UTC +00:00]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = 822229645  [["title", "Becoming a Web Developer"], ["body", "\nThis is how I learned web development!"], ["updated_at", Mon, 20 Jan 2014 21:34:57 UTC +00:00]]