app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "4"]]
UPDATE "projects" SET "name" = ?, "technologies_used" = ?, "updated_at" = ? WHERE "projects"."id" = 703402084  [["name", "My Rad Portfolio"], ["technologies_used", "\nRuby, Rails, Zurb"], ["updated_at", Thu, 23 Jan 2014 01:02:05 UTC +00:00]]
---
  def update
    @project = Project.find(params[:id])

    if @project.update_attributes(params[:project])

INSERT INTO "projects" ("created_at", "name", "technologies_used", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 23 Jan 2014 06:27:37 UTC +00:00], ["name", "a new project"], ["technologies_used", "describe"], ["updated_at", Thu, 23 Jan 2014 06:27:37 UTC +00:00]]
---
  def create
    @project = Project.new(project_params)
    if @project.save